**`commonimages/base/rhel_7_9`** terraform plan on `pull_request` event [#30](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
data.aws_secretsmanager_secret_version.environment_management: Reading...
data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_ami.parent[0]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["stig-build-linux-medium"]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_ami.parent[0]: Read complete after 0s [id=<REDACTED>]
data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["stig-build-linux-medium"]: Read complete after 1s [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/base-rhel-7-9" -> (known after apply)
      ~ date_created                     = "2022-11-16T11:57:54.209Z" -> (known after apply)
      + date_last_run                    = (known after apply)
      + date_next_run                    = (known after apply)
      ~ date_updated                     = "2022-11-16T11:57:54.209Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/base-rhel-7-9" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-rhel-7-9/0.0.1" -> (known after apply) # forces replacement
        name                             = "base_rhel_7_9"
      ~ platform                         = "Linux" -> (known after apply)
        tags                             = {
            "application"                     = "n/a"
            "base_rhel_7_9_ansible-version"   = "0.0.1"
            "base_rhel_7_9_packages-version"  = "0.0.1"
            "base_rhel_7_9_python-version"    = "0.0.1"
            "branch"                          = "main"
            "business-unit"                   = "HMPPS"
            "github-actor"                    = "wullub"
            "image-pipeline"                  = "base_rhel_7_9"
            "image-recipe"                    = "base_rhel_7_9/0.0.1"
            "infrastructure-configuration"    = "base_rhel_7_9/0.0.1"
            "is-production"                   = "true"
            "os-version"                      = "rhel 7.9"
            "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"                = "n/a"
            "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
            "stig-build-linux-medium-version" = "2022.3.2"
            "update-linux-version"            = "1.0.2"
        }
        # (6 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-rhel-7-9/0.0.1" -> (known after apply)
      ~ date_created     = "2022-11-16T11:57:52.141Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-rhel-7-9/0.0.1" -> (known after apply)
        name             = "base_rhel_7_9"
      ~ owner            = "374269020027" -> (known after apply)
      ~ platform         = "Linux" -> (known after apply)
        tags             = {
            "application"                     = "n/a"
            "base_rhel_7_9_ansible-version"   = "0.0.1"
            "base_rhel_7_9_packages-version"  = "0.0.1"
            "base_rhel_7_9_python-version"    = "0.0.1"
            "branch"                          = "main"
            "business-unit"                   = "HMPPS"
            "github-actor"                    = "wullub"
            "image-pipeline"                  = "base_rhel_7_9"
            "image-recipe"                    = "base_rhel_7_9/0.0.1"
            "infrastructure-configuration"    = "base_rhel_7_9/0.0.1"
            "is-production"                   = "true"
            "os-version"                      = "rhel 7.9"
            "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"                = "n/a"
            "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
            "stig-build-linux-medium-version" = "2022.3.2"
            "update-linux-version"            = "1.0.2"
        }
      + user_data_base64 = (known after apply)
        # (4 unchanged attributes hidden)

      - block_device_mapping { # forces replacement
          - device_name = "/dev/sda1" -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - volume_size           = 2 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping { # forces replacement
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

        # (6 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

```
